Revit 2027 API
PanelScheduleData.UpdateVerticalHeadersInSection Method
 Sets if this header should have vertical text
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void UpdateVerticalHeadersInSection(
	SectionType sectionType,
	bool bVertical
)
Public Sub UpdateVerticalHeadersInSection (
	sectionType As SectionType,
	bVertical As Boolean
)
public:
void UpdateVerticalHeadersInSection(
	SectionType sectionType,
	bool bVertical
)
member UpdateVerticalHeadersInSection :
        sectionType : SectionType *
        bVertical : bool -> unit
Parameters
sectionType SectionType
 The section type
bVertical Boolean
 Whether headers are vertical or not
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace